#!/bin/bash

echo "----------------------------------------"
echo "စနစ်ကို အဆင့်မြှင့်တင်နေပါပြီ (System Update)..."
echo "----------------------------------------"
apt update && apt upgrade -y
apt install curl wget unzip -y

echo "----------------------------------------"
echo "၁။ V2Ray / Xray Core ကို ထည့်သွင်းနေပါပြီ..."
echo "----------------------------------------"
apt install xray -y

echo "----------------------------------------"
echo "၂။ SSH WebSocket ကို ပြင်ဆင်နေပါပြီ..."
echo "----------------------------------------"
apt install nginx python3 -y

echo "----------------------------------------"
echo "တပ်ဆင်ခြင်း အားလုံး ပြီးဆုံးပါပြီ။"
echo "----------------------------------------"
